In [15]:
import pandas as pd

In [16]:
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

In [11]:
world[(world['area'] > 3000000) | (world['population'] > 25000000)][['name', 'population', 'area']]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

In [18]:
world.query("area >= 3000000 or population >= 25000000")[['name', 'population', 'area']]

/var/folders/p3/g25fc4fn5_94qr376nhv0tk80000gn/T/ipykernel_1884/494701488.py:1: RuntimeWarning: Engine has switched to 'python' because numexpr does not support extension array dtypes. Please set your engine to python manually.
  world.query("area >= 3000000 or population >= 25000000")[['name', 'population', 'area']]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741